In [2]:
import pandas as pd
import numpy as np

In [2]:
data =  {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [4]:
data = exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [17]:
df = pd.DataFrame(data,index=labels)

In [11]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [15]:
df[["name","score"]]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [16]:
print(df.iloc[[1,3,5,7],[1,3]])

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
h    NaN      no

In [17]:
print(df[df["attempts"]>2])

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [20]:
r = len(df.axes[0])
c = len(df.axes[1])
print(r," ",c)

10   4

In [26]:
print(df[df["score"].isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [29]:
print(df[df["score"].between(15,20)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [33]:
print(df[(df['attempts'] < 2) & (df['score'] > 15)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [6]:
df.loc['d','score']=11.5

In [7]:
df["attempts"].sum()

19

In [8]:
df["score"].mean()

13.333333333333334

In [10]:
df.loc['k'] = [1, 'Suresh', 'yes', 15.5]

In [16]:
df.sort_values(by=["name","score"],ascending=[True,False])

        name   score attempts qualify
k          1  Suresh      yes     NaN
a  Anastasia    12.5        1     NaN
b       Dima     9.0        3     NaN
e      Emily     9.0        2     NaN
d      James    11.5        3     NaN
j      Jonas    19.0        1     NaN
c  Katherine    16.5        2     NaN
i      Kevin     8.0        2     NaN
h      Laura     NaN        1     NaN
g    Matthew    14.5        1     NaN
f    Michael    20.0        3     NaN

In [18]:
df['qualify'] = df['qualify'].map({'yes':True,'no':False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True